Module-2/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "meemep"], ["user_id", 1], ["content", "meepkep"], ["created_at", "2017-05-26 16:15:08.726707"], ["updated_at", "2017-05-26 16:15:08.726707"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save