Module-2/flowers/app/controllers/flowers_controller.rb

SELECT "flowers".* FROM "flowers"
---
  def index
    @flowers = Flower.all

INSERT INTO "flowers" ("name", "smokeable", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "testsdfdsfs"], ["smokeable", "t"], ["price", 2], ["created_at", "2017-05-23 18:23:17.923521"], ["updated_at", "2017-05-23 18:23:17.923521"]]
---
  def create
    @flower = Flower.new(flower_params)
    if @flower.save

UPDATE "flowers" SET "smokeable" = ?, "updated_at" = ? WHERE "flowers"."id" = ?  [["smokeable", "t"], ["updated_at", "2017-05-23 18:49:01.648804"], ["id", 1]]
---
  def update
    @flower = find_flower

    if @flower.update(flower_params)

DELETE FROM "flowers" WHERE "flowers"."id" = ?  [["id", 4]]
---
  def destroy
    @flower = find_flower
    @flower.destroy

SELECT  "flowers".* FROM "flowers" WHERE "flowers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_flower
     Flower.find(params[:id])