Module-2/flowers/app/controllers/users_controller.rb

  def create
    @user = User.create(params.require(:user).permit(:email, :username, :password))
---
INSERT INTO "users" ("email", "username", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["email", "tony@tony.com"], ["username", "toneloke"], ["created_at", "2017-05-23 19:32:32.493114"], ["updated_at", "2017-05-23 19:32:32.493114"], ["password", "dragons"]]